/* 
generateStaticParams ব্যবহার করলে Next.js-এ SSG (Static Site Generation) ঘটে।

সহজ কথায়, বিল্ড নেওয়ার সময়েই (Build Time) Next.js নির্দেশিত পেজগুলোর (যেমন: আইডি অনুযায়ী সব খাবার ডিটেইলস পেজ) জন্য আগেই HTML ফাইল তৈরি (Prerender) করে রাখে।

এটি করার সুবিধা (Benefits):
রকেট ফাস্ট লোডিং (Super Fast Performance):
ইউজার যখন ওই খাবার পেজে ঢুকবে, তখন সার্ভারকে নতুন করে ডাটা ফেচ করতে হয় না বা পেজ তৈরি করতে হয় না। আগে থেকে বানিয়ে রাখা HTML ব্রাউজারে সাথে সাথে লোড হয়ে যায়।

সার্ভার কম প্রেসার পায়:
প্রতিটি ভিজিটের জন্য এপিআই (API) কল হয় না, ফলে এপিআই ডাটাবেজ এবং সার্ভারের উপর চাপ অনেক কমে যায়।

SEO Friendly:
গুগল সার্চ ইঞ্জিন খুব সহজে পেজের সব কন্টেন্ট ও ইমেজ ইনডেক্স করতে পারে, যা র‍্যাঙ্কিং বাড়াতে সাহায্য করে।

কীভাবে কাজ করে?
generateStaticParams ছাড়া: ইউজার লিংক ভিজিট করলে সার্ভার রিকোয়েস্ট ধরে এপিআই কল করবে, এইচটিএমএল বানাবে, তারপর রেসপন্স দেবে (Dynamic / SSR)।

generateStaticParams থাকলে: প্রজেক্ট npm run build দেওয়ার সময়েই Next.js অবজেক্টে দেওয়া আইডিগুলোর জন্য আগে থেকেই স্থায়ী .html ফাইল বানিয়ে রাখে (Static / SSG)।


*/

/* Prefetch (Cool EkTa jinish, jokhon npm run build diye korbo tokhon moja ta pabo, )

generateStaticParams ব্যবহার করলে Next.js-এ SSG (Static Site Generation) ঘটে।
সহজ কথায়, বিল্ড নেওয়ার সময়েই (Build Time) Next.js নির্দেশিত পেজগুলোর (যেমন: আইডি অনুযায়ী সব খাবার ডিটেইলস পেজ) জন্য আগেই HTML ফাইল তৈরি (Prerender) করে রাখে।
এটি করার সুবিধা (Benefits):
রকেট ফাস্ট লোডিং (Super Fast Performance): ইউজার যখন ওই খাবার পেজে ঢুকবে, তখন সার্ভারকে নতুন করে ডাটা ফেচ করতে হয় না বা পেজ তৈরি করতে হয় না। আগে থেকে বানিয়ে রাখা HTML ব্রাউজারে সাথে সাথে লোড হয়ে যায়।
সার্ভার কম প্রেসার পায়: প্রতিটি ভিজিটের জন্য এপিআই (API) কল হয় না, ফলে এপিআই ডাটাবেজ এবং সার্ভারের উপর চাপ অনেক কমে যায়।
SEO Friendly: গুগল সার্চ ইঞ্জিন খুব সহজে পেজের সব কন্টেন্ট ও ইমেজ ইনডেক্স করতে পারে, যা র‍্যাঙ্কিং বাড়াতে সাহায্য করে।
কীভাবে কাজ করে?
generateStaticParams ছাড়া: ইউজার লিংক ভিজিট করলে সার্ভার রিকোয়েস্ট ধরে এপিআই কল করবে, এইচটিএমএল বানাবে, তারপর রেসপন্স দেবে (Dynamic / SSR)।
generateStaticParams থাকলে: প্রজেক্ট npm run build দেওয়ার সময়েই Next.js অবজেক্টে দেওয়া আইডিগুলোর জন্য আগে থেকেই স্থায়ী .html ফাইল বানিয়ে রাখে (Static / SSG)।
১. ISR (next: { revalidate: 10 }) কীভাবে কাজ করে?
ISR হলো Static Site Generation (SSG) এবং Dynamic Server Rendering (SSR)-এর সেরা সংমিশ্রণ।
প্রথম ভিউ: ইউজার পেজে ঢুকলে Next.js ক্যাশ (Cache) করা HTML ফাইল থেকে সাথে সাথে ডাটা দেখায়।
১০ সেকেন্ডের মধ্যে: পরবর্তী ১০ সেকেন্ডে যত ইউজারই এই পেজে আসুক না কেন, এপিআই ব্যাকএন্ডে কোনো নতুন রিকোয়েস্ট পাঠাবে না। ক্যাশ থেকেই ডাটা খুব দ্রুত দেখাবে।
১০ সেকেন্ড পর (Background Revalidation): ১০ সেকেন্ড পর প্রথম যে ইউজার পেজে আসবে, সে তখনকার ক্যাশ ডাটাই দেখবে (ফাস্ট লোড)। কিন্তু ব্যাকগ্রাউন্ডে Next.js এপিআই-তে নতুন রিকোয়েস্ট পাঠিয়ে ডাটা আপডেট করে নতুন HTML তৈরি করে রাখবে।
পরের ইউজারের জন্য: ব্যাকগ্রাউন্ডে রেসপন্স আসার পর থেকে সবাই আবার নতুন বা আপডেট ডাটা দেখতে পাবে।

২. কেন force-cache ব্যবহার করা হয় নাই?
cache: 'force-cache' হলো Static Site Generation (SSG)।
সমস্যা: এটি ব্যবহার করলে ডাটা একবার ফেচ হয়ে ক্যাশ হয়ে যায় এবং সারাজীবনের জন্য ফিক্সড (Indefinite Cache) হয়ে থাকে। আপনি যতক্ষণ না আবার নতুন করে পুরো প্রজেক্ট বিল্ড দেবেন বা রি-ডিপ্লয় করবেন, ততক্ষণ ডাটাবেজে খাবার বা মেনু পরিবর্তন হলেও ওয়েবসাইট আপডেট হবে না।
রেস্তোরাঁ অ্যাপের সীমাবদ্ধতা: কোনো খাবার আউট অব স্টক (Out of Stock) হতে পারে, দাম পরিবর্তন হতে পারে বা নতুন মেনু আইটেম আসতে পারে। force-cache দিলে ইউজার সবসময় পুরানো ডাটাই দেখতে পাবে।


না, সবার ক্ষেত্রে আলাদাভাবে এপিআই কল বা নতুন করে রি-ফেচ হবে না! এটাই ISR (Incremental Static Regeneration)-এর আসল জাদু।
বিষয়টি কীভাবে কাজ করে দেখুন:
ধরুন, একটি রেস্তোরাঁ পেজের revalidate: 10 দেওয়া আছে:
ইউজার A (সকাল ১০:০০:০০ - একদম প্রথম ইউজার):
ইনি ওয়েবসাইটে ঢুকলেন।
সার্ভার থেকে এপিআই কল হলো, ডাটা আসলো এবং Next.js পেজটিকে ক্যাশ (Cache) করে ফেলল।
ইউজার B, C, D (সকাল ১০:০০:০১ থেকে ১০:০০:০৯-এর মধ্যে শত শত ইউজার আসলো):
এদের কারো জন্যই সার্ভার বা এপিআই-তে রিকোয়েস্ট যাবে না।
ইউজার A-এর সময় ক্যাশ হওয়া তৈরি ফাইলটিই এই বাকি সব ইউজার সাথে সাথে দেখতে পাবে।
১০ সেকেন্ড পার হলো (সকাল ১০:০০:১০)।
ইউজার E (সকাল ১০:০০:১১ - নতুন ১০ সেকেন্ড সাইকেলের প্রথম ইউজার):
ইনি ঢুকলে সাথে সাথে ক্যাশ ফাইলটিই দেখতে পাবেন (কোনো ডিলে ছাড়া)।
কিন্তু ব্যাকগ্রাউন্ডে Next.js চুপিচুপি নতুন ডাটার জন্য একবার এপিআই কল করে ক্যাশ ফাইলটিকে আপডেট করে রাখবে।
ইউজার F (সকাল ১০:০০:১২):
ইনি ইউজার E-এর সময় ব্যাকগ্রাউন্ডে আপডেট হওয়া নতুন ক্যাশ পেজটি দেখতে পাবেন।
সারসংক্ষেপ:
প্রতি ইউজারের জন্য আলাদা ক্যাশ তৈরি হয় না। ক্যাশটি তৈরি হয় সার্ভার লেভেলে গ্লোবালি।
১ লাখ ইউজারও যদি ১০ সেকেন্ডের মধ্যে ওয়েবসাইটে আসে, এপিআই কল হবে মাত্র ১ বার। বাকি ৯৯,৯৯৯ জন ইউজার সার্ভারের ক্যাশ থেকেই ইনস্ট্যান্ট পেজ লোড পেয়ে যাবে।

 */



/* 
    Tricks
    metadata cleint e use kora jay na, so amra client code k alada kore, server e metadata likhsi, reviews dekhle bujhbi


    // title.absolute ব্যবহার করার কারণ হলো Next.js-এর Root Layout-এ সেট করা টাইটেল টেমপ্লেটকে (Title Template) বাইপাস করা বা অমান্য করা।


    export const metadata = {
    title: {
    // Dynamic
    default: "Yantun khaijan | Delicious Food & Dining",
    template: '%s | Yantun Khaijan'
    },
    description: "Experience the finest food & ordering experience in Noakhali",
};


*/


